In [1]:
import pandas as pd
import numpy as np

In [2]:
bx_users=pd.read_csv(r"C:\Users\TOMORI\Documents\Data\bx_users.csv")
bx_users

        user_id                            location   age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

In [3]:
pd.DataFrame(bx_users.isnull().count())

               0
user_id   278858
location  278858
age       278858

In [4]:
bx_users.dtypes

user_id       int64
location     object
age         float64
dtype: object